["So I painted my laptop black, hoping it would run faster… Now it doesnt work.",
"Say what you want about pedophiles but they do drive slower through school zones",
"Whats the difference between a gay man and a freezer? A freezer doesnt fart when you pull the meat out.",
"What do you tell a woman with two black eyes? Nothing you already done told her twice.",
"Whats white on top and black on bottom? US culture",
"Why do Jews have big noses? Because air is free.",
"What happened when the Jew walked into the wall with a hard-on? He broke his nose.",
"How long does it take for a black woman to take a shit? Nine months.",
"How do you get a nun pregnant? Dress her up like an altar boy.",
"How many Jews can you fit into a car? 2 in the front, 3 in the back, and 5,999,995 in the ashtray",
"How many women does it take to screw in a lightbulb? None, they just sit in the dark and bitch.",
"What do spinach and anal sex have in common? If you were forced to have it as a kid, youll hate it as an adult.",
"Whats the worst thing about being black and Jewish? Having to sit in the back of the oven.",
"Mohamed and Mouloud are in a car, whos driving? The police",
"What do you call two Arab guys in front of a trash can? A family portrait",
"What do you call two Arab guys with two Arab girls in front of a trash can? A night-club",
"How long does it take an Arab woman to take out the trash? Nine months",
"Whats the difference between E.T and an Arab? E.T eventually went home",
"Whats the one thing an Arab would never get? A job",
"Whats a pedophiles favorite part of a hockey game? Before the First Period.",
"How do you swat 200 flies at one time? Hit an Ethiopian in the face with a frying pan.",
"Whats black and blue and doesnt like to have sex? The 9-year-old girl in my basement.",
"How many feminists does it take to change a light bulb? One, she just holds the bulb to the socket and waits for the world to revolve around her.",
"Whats the difference between jelly and jam? I cant jelly my dick down a babys throat.",
"Why does Stephen Hawking do one-liners? Because he cant do stand up.",
"Did you hear the Score of the Egypt vs Ethiopia soccer game? Egypt 8, Ethiopia didnt.",
"How many cops does it take to change a light bulb? They dont. They arrest the bulb for being broke and beat the room for being black.",
"Whats 9 inches long, pink, and makes my girlfriend scream when I put it in her mouth? Her miscarriage.",
"Whats the hardest part of eating bald pussy? Getting the diaper back on.",
"Whats difference between dollars and Jews? Id give a shit if I lost 6 million dollars.",
"9 out of 10 people enjoy gang rape",
"Whats the best part about fucking a 12-year-old girl? If you flip her over she looks like her little brother",
"What do you get when you cross goat DNA with human DNA? You get kicked out of the petting zoo.",
"I dont understand why Obama has to give his speeches behind bullet proof glass. I mean, I know hes black and all, but I doubt hell shoot anyone.",
"Whats the difference between a Jew and Harry Potter? Harry can escape the chamber.",
"What do you call a woman who thinks she can do anything a man can do? Wrong.",
"Whats the difference between black people and snow tires? A: A snow tire doesnt sing when you put chains on it.",
"Whats the difference between cancer and black people? Cancer got Jobs.",
"What do Sarah Palin and Iron Man have in common? They both had a Downey Jr. inside of them.",
"A black, a Muslim and a Mexican jump off a cliff to see who gets to the bottom first. Who wins? A: Society."]